Repository: AutoContCZ/AC-NAV-TranslationMemory
Catalog: TM_Helps_Final_Version.tmx
Source language: en_us
Languages: cs_cz

source: To make the custom layout available in a specific company only, choose Edit, and then set the Company Name field to the company that you want.
cs_cz: Chcete-li vytvořit vlastní uspořádání pouze v konkrétní společnosti, zvolte možnost Upravit a poté pole Název společnosti k nastavení na požadované společnosti.

source: Change Which Layout is Currently Used on a Report
cs_cz: Změna využívaného rozvržení pro danou sestavu

source: You can extend a standard text for items by adding extra lines, and you can set up conditions for use of the extra lines.
cs_cz: Můžete rozšířit standardní text pro položky přidáním dalších řádků a také můžete nastavit podmínky pro použití dalších extra řádků.

source: You do this from item cards.
cs_cz: Toto nastavení uděláte na kartě zboží.

source: To define extended text for an item description
cs_cz: Definování rozšířeného textu pro popis položky (zboží).

source: Open the card for an item that you want to add extended text to, and then choose the Extended Text action.
cs_cz: Otevřete kartu zboží, do které chcete přidat rozšířený text, a potom vyberte tlačítko Rozšířené texty.

source: In the Code field, enter the code, and in the Description field, enter the desired text.
cs_cz: V poli Kód vložte kód a do pole Popis vložte požadovaný text.

source: Choose Extended Texts.
cs_cz: Zvolte Rozšířené texty.

source: Fill in the lines in the Extended Text window with the additional text.
cs_cz: Vyplňte další řádky v okně Rozšířené texty.

source: Fill in the Language Code field or the All Language Codes field if you use language codes.
cs_cz: Vyplňte Kód jazyka nebo Kódy všech jazyků, pokud používáte kódy jazyků.

source: Fill in the Starting Date and Ending Date fields if you want to limit the dates on which the extended text is used.
cs_cz: Vyplňte pole Počáteční datum a Koncové datum, pokud chcete nastavit limit pomocí data.

source: Select relevant check boxes for the document types where you want the extended text printed.
cs_cz: Zaškrtněte příslušná políčka pro typy dokumentů, ve kterých chcete vytisknout rozšířený text.

source: A report can be set up with more than one report layout, which you can then switch among as needed.
cs_cz: Sestava může být nastavena s více než jedním rozvržením, které můžete podle potřeby přepínat.

source: Depending on the layouts that are available for a report, you can choose to use a built-in RDLC report layout, a built-in Word report layout, or a custom layout.
cs_cz: V závislosti na rozvržení, které jsou k dispozici pro sestavu, můžete zvolit použití vestavěného rozvržení sestavy RDLC, vestavěného rozvržení sestavy aplikace Word nebo vlastního rozvržení.

source: To change the layout that is used on a report
cs_cz: Změna využívaného rozvržení pro sestavu

source: The Report Layout Selection window lists all the reports that are available for the company that is specified in the Company field at the top of the window.
cs_cz: Okno Výběr rozvržení sestav obsahuje seznam všech sestav, které jsou k dispozici ve společnosti, která je uvedena v poli Společnost v horní části okna.

source: The Selected Layout field specifies the layout that is currently used on the report.
cs_cz: Pole Vybrané rozložení určuje rozvržení, které se aktuálně používá v sestavě.

source: Set the Company field at the top of the window to the company that includes the report.
cs_cz: Pole Název společnosti v horní části okna nastavte na společnost, ve které se používá daná sestava.

source: To change the layout that is used by a report, in the row for the report in the list, set the Selected Layout field to one of the following options:
cs_cz: Chcete-li změnit rozvržení, které používá sestava, v řádku seznamu sestav nastavte pole Vybrané rozložení na jednu z následujících možností:

source: RDLC (built-in), uses the built-in RDLC report layout on the report.
cs_cz: RDLC (vestavěný) používá vestavěné RDLC rozvržení sestavy

source: Word (built-in), uses the built-in Word report layout on the report.
cs_cz: Word (vestavěný) používá vestavěné Word rozvržení sestavy

source: Custom, uses a custom layout on the report.
cs_cz: Vlastní používá vlastní rozvržení sestavy

source: You can see which custom layouts are available for the report in the Report Layouts Part FactBox.
cs_cz: Můžete vidět, které vlastní rozvržení jsou k dispozici pro sestavu v část FactBoxu Rozvržení sestav.

source: If there are no custom layouts for the report, then you will have to create one first.
cs_cz: Pokud pro sestavu neexistují žádné vlastní rozvržení, budete muset vytvořit nejprve nové.

source: If you choose this option, go to the next procedure to specify the custom layout that you want to use.
cs_cz: Pokud zvolíte tuto možnost, přejděte k dalšímu postupu, abyste navrhli vlastní rozvržení, které chcete použít.

source: If you choose RDLC (built-in) or Word (built-in) and you get an error message that the report does not have a layout of the specified type, then you must choose another layout option or create a custom report layout of the type that you want to use.
cs_cz: Pokud zvolíte RDLC (vestavěný) nebo Word (vestavěný) a zobrazí se chybová zpráva, že sestava nemá rozložení zadaného typu, musíte vybrat jinou možnost rozložení nebo vytvořit vlastní rozvržení sestavy daného typu.

source: If you selected a built-in RDLC or Word report layout, then no further action is required and the layout will be used the next time the report is run.
cs_cz: Pokud jste vybrali vestavěné rozložení sestav RDLC nebo Word, není třeba provádět žádné další akce a rozložení bude použito při příštím spuštění sestavy.

source: To specify a custom layout on a report
cs_cz: Navrhnutí vlastního rozvržení sestavy

source: You specify which custom layout to use on the report from the Custom Report Layouts window.
cs_cz: Můžete navrhnou vlastní rozvržení sestavy na sestavu z okna Vlastní rozvržení sestav.

source: If the Custom Report Layouts window is not open, then in the Report Layout Description field, choose the lookup button.
cs_cz: Není-li okno Vlastní rozvržení sestav otevřené, vyberte v poli Popis rozvržení sestavy tlačítko pro rozbalení.

source: In the Custom Report Layouts window, select the row for custom layout that you want to use, and then choose the OK button.
cs_cz: V okně Vlastní rozvržení sestav vyberte řádek pro vlastní rozložení, které chcete použít, a potom klepněte na tlačítko OK.

source: You return to the Report Layout Selection window.
cs_cz: Vrátíte se do okna Výběr rozvržení sestav.

source: The name of the selected custom layout displays in the Custom Layout Description field.
cs_cz: Název vybraného vlastního rozvržení se zobrazí v poli Popis vlastního rozvržení.

source: The custom layout will be used the next time that you run the report.
cs_cz: Vlastní rozložení se použije při příštím spuštění sestavy.

source: Preview Posting Results
cs_cz: Náhled výsledků účtování

source: On every document and journal that can be posted, you can choose the Preview Posting button to review the different types of entries that will be created when you post the document or journal.
cs_cz: Na každém dokumentu a deníku, který lze účtovat, můžete vybrat tlačítko Náhled účtování, kde můžete zkontrolovat různé typy záznamů, které budou vytvořeny při zaúčtování dokumentu nebo deníku.

source: To preview G/L entries that will result from posting a purchase invoice
cs_cz: Zobrazení náhledu položek hlavní knihy, které vyplynou z účtování nákupní faktury

source: Create a purchase invoice.
cs_cz: Vytvořte nákupní fakturu.

source: Choose Preview Posting.
cs_cz: Zvolte Náhled účtování.

source: In the Posting Preview window, select G/L Entry, and then choose Show Related Entries.
cs_cz: V okně Náhled účtování vyberte Věcná položka a Ukázat související položky.

source: The G/L Entries Preview window shows which entries will be created when you post the purchase invoice.
cs_cz: Okno Náhled věcných položek ukáže, které položky budou vytvořeny, pokud je zaúčtujete na nákupní faktuře.

source: Post Documents and Journals
cs_cz: Účtování Dokladů a Deníků

source: If you want to use services that are based on Microsoft Azure, you must register your Dynamics NAV in the Azure Management Portal.
cs_cz: Pokud chcete používat služby založené na programu Microsoft Azure, musíte registrovat svůj Dynamics NAV na portálu pro správu Azure.

source: For example, the Sales and Inventory Forecast extension requires that you specify an API key and API URI, and other services require similar information.
cs_cz: Například rozšíření Prognóza prodeje a zásob vyžaduje zadání klíče API a URI API a další služby vyžadují obdobné informace.

source: So where do you find that information?
cs_cz: Takže kde najdete tyto informace?

source: You can use the Set Up Azure Management Portal guide to register Dynamics NAV in the Azure Management Portal and extract the information you need to use services such as the Sales and Inventory Forecast extension, Power BI, Office 365, and so on.
cs_cz: Pro registraci Dynamics NAV v portálu pro správu můžete použít průvodce Nastavení portálu pro správu Azure a extrahovat informace, které potřebujete k používání služeb, jako například prodloužení Prognózy prodeje a zásob, Power BI, Office 365 atd.

source: You must register in the Azure Management Portal only once, and you must be an administrator or superuser in Dynamics NAV.
cs_cz: Na portálu pro správu Azure se stačí registrovat pouze jednou, nicméně musíte být v Dynamics NAV buď správcem nebo superuživatelem.

source: The point of the registration is that Dynamics NAV and the service that you want to connect to must know the Azure Active Directory (Azure AD) details about each other.
cs_cz: Bod registrace znamená, že služba Dynamics NAV a služba, kterou chcete připojit, musí o sobě znát podrobnosti Azure Active Directory (Azure AD).

source: To register Dynamics NAV in the Azure Management Portal
cs_cz: Registrace Dynamics NAV v portálu pro správu Azure

source: Log in to the Azure Management Portal at https://portal.azure.com.
cs_cz: Přihlaste se k portálu pro správu Azure https://portal.azure.com.

source: If you are not familiar with the Azure Management Portal, you can find guidance in the Azure documentation library.
cs_cz: Pokud nejste obeznámeni s portálem pro správu Azure, najdete pokyny v Knihovně dokumentace Azure.

source: In the left navigation pane, choose More services, and then choose App registrations.
cs_cz: V levém navigačním podokně vyberte možnost Více služeb, a poté zvolte Registrace aplikací.

source: In the top menu, choose Add, and then, in the Create pane, fill in the fields with the following information:
cs_cz: V horním menu vyberte možnost Přidat, a poté v podokně Vytvořit vyplňte pole s následujícími informacemi:

source: Name:
cs_cz: Název:

source: Specify a name for your Dynamics NAV solution, such as Dynamics NAV.
cs_cz: Zadejte název pro Vaše řešení Dynamics NAV, jako například Dynamics NAV.

source: Application Type:
cs_cz: Typ aplikace:

source: Choose Web app / API*.
cs_cz: Vyberte Webovou aplikaci rozhraní / API*.

source: Sign-on URL:
cs_cz: Přidat URL:

source: Enter the URL for your Dynamics NAV browser client, such as https://MyServer:8080/DynamicsNAV/WebClient/OAuthLanding.htm.
cs_cz: Zadejte adresu URL pro vašeho webového klienta Dynamics NAV, například https://MyServer:8080/DynamicsNAV/WebClient/OAuthLanding.htm.

source: The OAuthLanding.htm file is a file that helps manage the exchange of data between Dynamics NAV and other services through Azure AD.
cs_cz: Soubor OAuthLanding.htm je soubor, který pomáhá spravovat výměnu dat mezi službou Dynamics NAV a dalšími službami prostřednictvím služby Azure AD.

source: Choose the Create button.
cs_cz: Zvolte tlačítko Vytvořit.

source: This adds your Dynamics NAV to the App registrations pane, so you can now add settings to it.
cs_cz: To přidává Váš Dynamics NAV do Podokna registrací aplikací, takže k němu nyní můžete přidat nastavení.

source: In the App registrations list, choose your new app.
cs_cz: V Seznamu registrací aplikace, vyberte Vaši novou aplikaci.

source: If this does not open the Settings pane, you should see an action to open Settings.
cs_cz: Pokud se tím neotevře podokno Nastavení, měla by se zobrazit akce k otevření Nastavení.

source: In the Settings pane, in the API Access section, choose Keys.
cs_cz: V podokně Nastavení, v sekci Přístup API, vyberte Klíče.

source: In the Keys pane, specify a description and when you want to let the key expire, and then choose Save.
cs_cz: V podokně Klíče zadejte popis a pokud chcete, aby klíč vypršel, pak vyberte možnost Uložit.

source: Copy the generated key to a temporary location - you will need it in the next procedure.
cs_cz: Zkopírujte vygenerovaný klíč do dočasného umístění - budete jej potřebovat pro další postup.

source: In the API Access section, choose Required Permissions.
cs_cz: V sekci Přístup API zvolte Požadované oprávnění.

source: Add delegated permissions to view all reports to the Power BI Service
cs_cz: Přidejte delegovaná oprávnění k zobrazení všech sestav služby Power BI

source: Add delegated permissions to Sign In and read user profile to Windows Azure Active Directory
cs_cz: Přidejte delegovaná oprávnění k Přihlášení a čtení uživatelského profilu v rámci služby Windows Azure Active Directory

source: Repeat for other services that you want to grant access to your Dynamics NAV
cs_cz: Opakujte pro další služby, kterým chcete povolit přístup do vašeho Dynamics NAV.

source: Close the Settings pane, and then, in the Essentials pane, copy the value of the Application ID to a temporary location.
cs_cz: Zavřete podokno Nastavení a potom z podokna Základy zkopírujte hodnotu ID aplikace do dočasného umístění.

source: You have now registered your Dynamics NAV in the Azure Management Portal, you have given access to the relevant services, and you have extracted the information that you need in Dynamics NAV.
cs_cz: Nyní jste zaregistrovali Váš Dynamics NAV na portálu pro správu Azure, dali jste přístup příslušným službám a získali jste informace, které potřebujete v Dynamics NAV.

source: To add the information to Dynamics NAV
cs_cz: Přidání informací do Dynamics NAV

source: In the top right corner, choose the Search for Page or Report icon, enter Azure AD Application Setup Wizard, and then choose the related link.
cs_cz: V pravém horním rohu zvolte ikonu Hledat stránku nebo sestavu, zadejte Nastavení Azure AD a zvolte související odkaz.

source: In the wizard, choose Next.
cs_cz: V průvodci zvolte Další.

source: In the Client ID field, specify the content that you copied from the Application ID field earlier.
cs_cz: Do pole ID klienta zadejte obsah, který jste předtím zkopírovali z pole ID aplikace.

source: In the Secret Key field, specify the content that you copied from the Keys pane earlier.
cs_cz: Do pole Tajný klíč, zadejte obsah, který jste předtím zkopírovali z pole Klíče.

source: Choose Next.
cs_cz: Vyberte možnost Další.

source: Unless you see an error message, you are now done.
cs_cz: Pokud se neobjeví chybová zpráva, jste hotoví.

source: Your Dynamics NAV is registered and ready to connect to services such as Cortana Intelligence and Power BI.
cs_cz: Váš Dynamics NAV je registrován a připraven k připojení ke službám, jako je například Cortana Intelligence a Power BI.

source: Run Batch Jobs
cs_cz: Spuštění dávkových úloh

source: A batch job is a routine that processes data in batches, for example the Adjust Exchange Rates batch job.
cs_cz: Dávková úloha je rutina, která zpracovává data v dávkách, jako například dávková úloha Úprava směnných kurzů.

source: There are batch jobs that perform periodic accounting activities, such as closing the income statement at the end of a fiscal year.
cs_cz: Existují dávkové úlohy, které provádějí pravidelné účetní činnosti, jako například uzávěrku výsledovky na konci fiskálního roku.

source: Many batch jobs do calculation work, such as calculation of finance-setup charges, exchange rate adjustment, and calculation of unit prices.
cs_cz: Mnoho dávkových úloh provádí výpočty, jako například výpočet poplatků za nastavení financí, vyrovnání kurzových rozdílů a výpočet jednotkových cen.

source: A batch job is like a report, except the batch job uses the result of its work to update information directly, instead of printing the results.
cs_cz: Dávková úloha je jako sestava, s výjimkou toho, že dávková úloha používá výsledek své práce k přímé aktualizaci informací, namísto tisku výsledků.

source: To run a batch job
cs_cz: Spustit dávkovou úlohu

source: To open the request window for the relevant batch job, in the top right corner, choose the Search for Page or Report icon, enter the name of the batch job, and then choose the related link.
cs_cz: K otevření okna požadavku pro relevantní dávkovou úlohu, zvolte v pravém horním rohu ikonu Hledat stránku nebo sestavu, zadejte název dávkové úlohy a zvolte související odkaz.

source: If there is an Options FastTab for the batch job, fill in the fields to determine what the batch job will do.
cs_cz: Pokud je zde pro dávkovou úlohu záložka Možnosti, vyplňte pole, k tomu abyste určili, co bude dávková úloha dělat.

source: The window may contain one or more FastTab with filters, which you can use to limit the data included in the batch job.
cs_cz: Okno může obsahovat jednu nebo více záložek s filtry, které můžete použít k omezení dat obsažených v dávkové úloze.

source: You can enter criteria in the suggested filters or add more filters.
cs_cz: Můžete zadat kritéria v navrhovaných filtrech nebo přidat více filtrů.

source: Choose the OK button to start the batch job.
cs_cz: Zvolte tlačítko OK pro spuštění dávkové úlohy.

source: To communicate the contents of business documents quickly to your business partners, such as the payment information on sales documents to customers, you can use the Report Layout feature to define document-specific content that gets inserted in email bodies automatically.
cs_cz: Chcete-li rychle informovat své obchodní partnery o obsahu obchodních dokumentů, například pokud chcete svým zákazníkům sdělit platební informace na prodejních dokladech, můžete pomocí funkce Rozvržení sestavy definovat obsah specifický pro doklad, který se do těl emailů bude automaticky vkládat.

source: To enable emails from within Dynamics NAV, start the Set Up Email assisted setup on the Home page.
cs_cz: Chcete-li povolit zasílání e-mailů ze služby Dynamics NAV, spusťte Nastavení e-mailů k asistovanému nastavení na Domovské stránce.

source: You can email practically all document types as attachments to email messages directly from the window that shows the document.
cs_cz: Jako přílohu k emailovým zprávám můžete zaslat prakticky všechny typy dokumentů, a to přímo z okna, ve kterém je dokument zobrazen.

source: In addition to the attachment, you can set up document-specific email bodies with core information from the document preceded by standard text that greets the mail recipient and introduces the document in question.
cs_cz: Kromě přílohy můžete nastavit těla emailů pro konkrétní doklady se základními informacemi z dokladu, kterým předchází standardní text, který pozdraví příjemce pošty a představí daný doklad.

source: To offer your customers to pay for sales electronically using a payment service, such as PayPal, you can also have the PayPal information and hyperlink inserted in the email body.
cs_cz: Chcete-li svým zákazníkům nabídnout platbu za prodej prostřednictvím elektronické platební služby, jako například prostřednictvím PayPal, můžete mít do těla emailu vložené i informace o PayPal a hypertextový odkaz.

source: From all supported documents, you initiate emailing by choosing the Send action, on posted documents, or the Post and Send action, on non-posted documents.
cs_cz: Ve všech podporovaných dokumentech iniciujete zasílání e-mailů pro zaúčtované doklady výběrem akce Odeslat a pro nezaúčtované výběrem akce Účtovat a Odeslat.

source: If the Email field in the Send Document To window is set to Yes (Prompt for Settings), then the Send Email window opens prefilled with the contact person in the To: field and the document attached as a PDF file.
cs_cz: Je-li pole E-mail v okně Komu odeslat doklad nastaveno na Ano (příkaz pro nastavení), pak se okno Odeslat e-mail otevře s již vyplněnou kontaktní osobou v poli Komu: a dokladem přiloženým jako soubor PDF.

source: In the Body field, you can either enter text manually or you can have the field filled with a document-specific email body that you have set up.
cs_cz: V poli Tělo zprávy můžete buď zadat text ručně, nebo můžete mít pole vyplněné specifickým tělem e-mailu, které jste nastavili.

source: The following procedure describes how to set the Sales - Invoice report up to be used for document-specific email bodies when you email posted sales invoices.
cs_cz: Následující postup popisuje, jak nastavit sestavu Prodej - faktura, která má být použita pro specifická těla emailů, když zasíláte zaúčtované prodejní faktury emailem.

source: To set up a document-specific email body for sales invoices
cs_cz: Nastavení specifického těla e-mailu pro prodejní faktury

source: In the top right corner, choose the Search for Page or Report icon, enter Report Selections Sales, and then choose the related link.
cs_cz: V pravém horním rohu vyberte ikonu Hledat stránku nebo sestavu, vložte Výběry sestav – prodej, a poté vyberte související odkaz.

source: In the Report Selection - Sales window, in the Usage field, select Invoice.
cs_cz: V okně Výběry sestav – prodej vyberte v poli Použití možnost Faktura.

source: On a new line, in the Report ID field, select, for example, standard report 1306.
cs_cz: Na novém řádku vyberte v poli ID sestavy například standardní sestavu 1306.

source: Select the Use for mail Body check box.
cs_cz: Zaškrtněte políčko Použít pro předmět pošty.

source: Choose the Email Body Layout ID field, and then select one of the available layouts from the Custom Report Layouts window.
cs_cz: Zvolte pole ID rozložení těla e-mailu a poté z okna Rozložení vlastní sestavy vyberte jedno z dostupných rozložení.

source: Report layouts define both the style and the content of the email body, including the standard text that precedes the core document information in the email body.
cs_cz: Rozložení sestavy definuje jak styl, tak obsah těla e-mailu, včetně standardního textu, který předchází základním informacím o dokladu v těle e-mailu.

source: To view or edit the layout that the email body is based on, in the Custom Report Layouts window, choose the Edit Layout action.
cs_cz: Chcete-li zobrazit nebo upravit rozložení, na kterém je tělo e-mailu založeno, v okně Rozložení vlastní sestavy zvolte akci Upravit rozložení.

source: If you want to offer customers to pay for sales electronically, you can set up the related payment service, such as PayPal, and then have the PayPal information and hyperlink inserted in the email body as well.
cs_cz: Chcete-li nabídnout zákazníkům elektronické platby za prodej, můžete nastavit příslušnou platební službu, jako je například PayPal, a pak mít do těla emailu vložené i údaje o PayPal a hypertextový odkaz.

source: Enable Customer Payments Through PayPal .
cs_cz: Povolení plateb prostřednictvím služby PayPal zákazníkům .

source: Now, when you choose, for example, the Send action in the Posted Sales Invoice window, the email body will contain the document information of report 1306 preceded by styled standard text according to the report layout that you selected in step 5.
cs_cz: Nyní, když zvolíte například akci Odeslat v okně Účtované prodejní faktury, bude tělo e-mailu obsahovat informace o dokladu sestavy 1306, kterému předchází stylizovaný standardní text podle rozložení sestavy, které jste vybrali v pátém kroku.
